sterentev/atdf-device-asm-include/inc/ATmega64.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	UCSR1C		= 0x9D		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UDR1		= 0x9C		; [MEMORY MAPPED] USART I/O Data Register
.equ	UCSR1A		= 0x9B		; [MEMORY MAPPED] USART Control and Status Register A
.equ	UCSR1B		= 0x9A		; [MEMORY MAPPED] USART Control and Status Register B
.equ	UBRR1L		= 0x99		; [MEMORY MAPPED] USART Baud Rate Register Low Byte
.equ	UBRR1H		= 0x98		; [MEMORY MAPPED] USART Baud Rate Register High Byte
.equ	UCSR0C		= 0x95		; [MEMORY MAPPED] USART Control and Status Register C
.equ	UBRR0H		= 0x90		; [MEMORY MAPPED] USART Baud Rate Register High Byte
.equ	ADCSRB		= 0x8E		; [MEMORY MAPPED] The ADC Control and Status register B
.equ	TCCR3C		= 0x8C		; [MEMORY MAPPED] Timer/Counter3 Control Register C
.equ	TCCR3A		= 0x8B		; [MEMORY MAPPED] Timer/Counter3 Control Register A
.equ	TCCR3B		= 0x8A		; [MEMORY MAPPED] Timer/Counter3 Control Register B
.equ	TCNT3		= 0x88		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3  Bytes
.equ	OCR3A		= 0x86		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3B		= 0x84		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3C		= 0x82		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Output compare Register C  Bytes
.equ	ICR3		= 0x80		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter3 Input Capture Register  Bytes
.equ	ETIMSK		= 0x7D		; [MEMORY MAPPED] Extended Timer/Counter Interrupt Mask Register
.equ	ETIFR		= 0x7C		; [MEMORY MAPPED] Extended Timer/Counter Interrupt Flag register
.equ	TCCR1C		= 0x7A		; [MEMORY MAPPED] Timer/Counter1 Control Register C
.equ	OCR1C		= 0x78		; [MEMORY MAPPED] [___2 addrs___] Timer/Counter1 Output Compare Register  Bytes
.equ	TWCR		= 0x74		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0x73		; [MEMORY MAPPED] TWI Data register
.equ	TWAR		= 0x72		; [MEMORY MAPPED] TWI (Slave) Address register
.equ	TWSR		= 0x71		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0x70		; [MEMORY MAPPED] TWI Bit Rate register
.equ	OSCCAL		= 0x6F		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	XMCRA		= 0x6D		; [MEMORY MAPPED] External Memory Control Register A
.equ	XMCRB		= 0x6C		; [MEMORY MAPPED] External Memory Control Register B
.equ	EICRA		= 0x6A		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	SPMCSR		= 0x68		; [MEMORY MAPPED] Store Program Memory Control Register
.equ	PORTG		= 0x65		; [MEMORY MAPPED] Data Register, Port G
.equ	DDRG		= 0x64		; [MEMORY MAPPED] Data Direction Register, Port G
.equ	PING		= 0x63		; [MEMORY MAPPED] Input Pins, Port G
.equ	PORTF		= 0x62		; [MEMORY MAPPED] Data Register, Port F
.equ	DDRF		= 0x61		; [MEMORY MAPPED] Data Direction Register, Port F
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; [___2 addrs___] Stack Pointer 
.equ	XDIV		= 0x3C		; XTAL Divide Control Register
.equ	EICRB		= 0x3A		; External Interrupt Control Register B
.equ	EIMSK		= 0x39		; External Interrupt Mask Register
.equ	EIFR		= 0x38		; External Interrupt Flag Register
.equ	TIMSK		= 0x37		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x36		; Timer/Counter Interrupt Flag register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUCSR		= 0x34		; MCU Control And Status Register
.equ	TCCR0		= 0x33		; Timer/Counter Control Register
.equ	TCNT0		= 0x32		; Timer/Counter Register
.equ	OCR0		= 0x31		; Output Compare Register
.equ	ASSR		= 0x30		; Asynchronous Status Register
.equ	TCCR1A		= 0x2F		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x2E		; Timer/Counter1 Control Register B
.equ	TCNT1		= 0x2C		; [___2 addrs___] Timer/Counter1  Bytes
.equ	OCR1A		= 0x2A		; [___2 addrs___] Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1B		= 0x28		; [___2 addrs___] Timer/Counter1 Output Compare Register  Bytes
.equ	ICR1		= 0x26		; [___2 addrs___] Timer/Counter1 Input Capture Register  Bytes
.equ	TCCR2		= 0x25		; Timer/Counter Control Register
.equ	TCNT2		= 0x24		; Timer/Counter Register
.equ	OCR2		= 0x23		; Output Compare Register
.equ	OCDR		= 0x22		; On-Chip Debug Related Register in I/O Memory
.equ	WDTCR		= 0x21		; Watchdog Timer Control Register
.equ	SFIOR		= 0x20		; Special Function IO Register
.equ	EEAR		= 0x1E		; [___2 addrs___] EEPROM Read/Write Access  Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTA		= 0x1B		; Port A Data Register
.equ	DDRA		= 0x1A		; Port A Data Direction Register
.equ	PINA		= 0x19		; Port A Input Pins
.equ	PORTB		= 0x18		; Port B Data Register
.equ	DDRB		= 0x17		; Port B Data Direction Register
.equ	PINB		= 0x16		; Port B Input Pins
.equ	PORTC		= 0x15		; Port C Data Register
.equ	DDRC		= 0x14		; Port C Data Direction Register
.equ	PINC		= 0x13		; Port C Input Pins
.equ	PORTD		= 0x12		; Port D Data Register
.equ	DDRD		= 0x11		; Port D Data Direction Register
.equ	PIND		= 0x10		; Port D Input Pins
.equ	SPDR		= 0x0F		; SPI Data Register
.equ	SPSR		= 0x0E		; SPI Status Register
.equ	SPCR		= 0x0D		; SPI Control Register
.equ	UDR0		= 0x0C		; USART I/O Data Register
.equ	UCSR0A		= 0x0B		; USART Control and Status Register A
.equ	UCSR0B		= 0x0A		; USART Control and Status Register B
.equ	UBRR0L		= 0x09		; USART Baud Rate Register Low Byte
.equ	ACSR		= 0x08		; Analog Comparator Control And Status Register
.equ	ADMUX		= 0x07		; The ADC multiplexer Selection Register
.equ	ADCSRA		= 0x06		; The ADC Control and Status register A
.equ	ADC		= 0x04		; [___2 addrs___] ADC Data Register  Bytes
.equ	PORTE		= 0x03		; Data Register, Port E
.equ	DDRE		= 0x02		; Data Direction Register, Port E
.equ	PINE		= 0x01		; Input Pins, Port E
.equ	PINF		= 0x00		; Input Pins, Port F
;
; ----------	REGISTERS PAIRS			------------------------
;    Timer/Counter3  Bytes
.equ	TCNT3H		= 0x89
.equ	TCNT3L		= 0x88
;    Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3AH		= 0x87
.equ	OCR3AL		= 0x86
;    Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3BH		= 0x85
.equ	OCR3BL		= 0x84
;    Timer/Counter3 Output compare Register C  Bytes
.equ	OCR3CH		= 0x83
.equ	OCR3CL		= 0x82
;    Timer/Counter3 Input Capture Register  Bytes
.equ	ICR3H		= 0x81
.equ	ICR3L		= 0x80
;    Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1CH		= 0x79
.equ	OCR1CL		= 0x78
;    Stack Pointer 
.equ	SPH		= 0x3E
.equ	SPL		= 0x3D
;    Timer/Counter1  Bytes
.equ	TCNT1H		= 0x2D
.equ	TCNT1L		= 0x2C
;    Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1AH		= 0x2B
.equ	OCR1AL		= 0x2A
;    Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1BH		= 0x29
.equ	OCR1BL		= 0x28
;    Timer/Counter1 Input Capture Register  Bytes
.equ	ICR1H		= 0x27
.equ	ICR1L		= 0x26
;    EEPROM Read/Write Access  Bytes
.equ	EEARH		= 0x1F
.equ	EEARL		= 0x1E
;    ADC Data Register  Bytes
.equ	ADCH		= 0x05
.equ	ADCL		= 0x04


; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SFIOR bits		------------------------
.equ	ACME		= 3		; 0x08 - Analog Comparator Multiplexer Enable

; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Reserved
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC  Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Source bits (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)



; ====	TWI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TWCR bits		------------------------
.equ	TWINT		= 7		; 0x80 - TWI Interrupt Flag
.equ	TWEA		= 6		; 0x40 - TWI Enable Acknowledge Bit
.equ	TWSTA		= 5		; 0x20 - TWI Start Condition Bit
.equ	TWSTO		= 4		; 0x10 - TWI Stop Condition Bit
.equ	TWWC		= 3		; 0x08 - TWI Write Collision Flag
.equ	TWEN		= 2		; 0x04 - TWI Enable Bit
.equ	TWIE		= 0		; 0x01 - TWI Interrupt Enable

; ----------	Register TWSR bits		------------------------
.equ	TWS_MASK	= 0xF8		;      - TWI Status (5 bits)
.equ	TWS0		= 3		;          TWS BIT0 position
.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler (2 bits)
.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWAR bits		------------------------
.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address register Bits (7 bits)
.equ	TWA0		= 1		;          TWA BIT0 position
.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR0A bits		------------------------
.equ	RXC0		= 7		; 0x80 - USART Receive Complete
.equ	TXC0		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE0		= 5		; 0x20 - USART Data Register Empty
.equ	FE0		= 4		; 0x10 - Framing Error
.equ	DOR0		= 3		; 0x08 - Data overRun
.equ	UPE0		= 2		; 0x04 - Parity Error
.equ	U2X0		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM0		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR0B bits		------------------------
.equ	RXCIE0		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE0		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE0		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN0		= 4		; 0x10 - Receiver Enable
.equ	TXEN0		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ02		= 2		; 0x04 - Character Size
.equ	RXB80		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB80		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR0C bits		------------------------
.equ	UMSEL0		= 6		; 0x40 - USART Mode Select
.equ	UPM0_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM00		= 4		;          UPM0 BIT0 position
.equ	USBS0		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ0_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ00		= 1		;          UCSZ0 BIT0 position
.equ	UCPOL0		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL0	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
; ::::  UPM0	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS0	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR1A bits		------------------------
.equ	RXC1		= 7		; 0x80 - USART Receive Complete
.equ	TXC1		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE1		= 5		; 0x20 - USART Data Register Empty
.equ	FE1		= 4		; 0x10 - Framing Error
.equ	DOR1		= 3		; 0x08 - Data overRun
.equ	UPE1		= 2		; 0x04 - Parity Error
.equ	U2X1		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM1		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
.equ	RXCIE1		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE1		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE1		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN1		= 4		; 0x10 - Receiver Enable
.equ	TXEN1		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ12		= 2		; 0x04 - Character Size
.equ	RXB81		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB81		= 0		; 0x01 - Transmit Data Bit 8

